app/controllers/auth_controller.rb

    def register
        if User.find_by(email: params['email']) != nil
            render json: { message: "Account already exists." }, status: :unauthorized
            return
        end

        user = User.create!(
          email:                 params['email'],
          password:              params['password'],
          password_confirmation: params['password_confirmation'],
          name:                  params['name']
        )
        if user
            session[:user_id] = user.id
            render json: UserResource.new(User.find(session[:user_id])).as_json, status: 200
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "codoreanluca@icloud.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "key", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]

    def login
        user = User.find_by(email: params['email'])

        if  user == nil
            render json: { message: "User not found"}, status: :unauthorized
            return
        end

        user.authenticate(params[:password])
        render json: UserResource.new(User.find(session[:user_id])).as_json, status: 200
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "codoreadorin@icloud.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]