app/controllers/user_controller.rb

    def index
        users = User.all
        render json: users.map { |user| UserResource.new(user).as_json }, status: 200
---
SELECT "users".* FROM "users"

    def update
        authorize @user
        if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", " Admin"], ["updated_at", "2024-10-18 19:53:16.777566"], ["id", 39]]

        def set_user
            @user = User.find_by(key: params[:key])
---
SELECT "users".* FROM "users" WHERE "users"."key" = $1 LIMIT $2  [["key", "use_PLtGCs6K77feMJfxxwUl"], ["LIMIT", 1]]